### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.request-handler-gha-app will be created
  + resource "azuread_application" "request-handler-gha-app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "faspo-poc-request-handler-gha"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = true
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # azuread_application_federated_identity_credential.request-handler-gha-app-fc will be created
  + resource "azuread_application_federated_identity_credential" "request-handler-gha-app-fc" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + display_name   = "faspo-poc-request-handler-gha-fc"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:scoring-system-poc/faspo-request-handler:ref:refs/heads/main"
    }

  # azuread_service_principal.request-handler-gha-sp will be created
  + resource "azuread_service_principal" "request-handler-gha-sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_cosmosdb_sql_role_assignment.request-handler-cdb-rbac will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "request-handler-cdb-rbac" {
      + account_name        = "faspo-poc-cdb"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "faspo-poc-data-rg"
      + role_definition_id  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleDefinitions/00000000-0000-0000-0000-000000000001"
      + scope               = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb"
    }

  # azurerm_federated_identity_credential.request-handler-uami-fc will be created
  + resource "azurerm_federated_identity_credential" "request-handler-uami-fc" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://germanywestcentral.oic.prod-aks.azure.com/d46035c4-e4ae-4ea6-904f-6f343b7b5673/58ceca04-e42f-4ca8-8369-4440618029ca/"
      + name                = "faspo-poc-request-handler-uami-fc"
      + parent_id           = (known after apply)
      + resource_group_name = "faspo-poc-sec-rg"
      + subject             = "system:serviceaccount:faspo-poc-apps:faspo-poc-request-handler-sa"
    }

  # azurerm_role_assignment.request-handler-gha-acr-rbac will be created
  + resource "azurerm_role_assignment" "request-handler-gha-acr-rbac" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.ContainerRegistry/registries/faspopocacr"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.request-handler-uami will be created
  + resource "azurerm_user_assigned_identity" "request-handler-uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "faspo-poc-request-handler-uami"
      + principal_id        = (known after apply)
      + resource_group_name = "faspo-poc-sec-rg"
      + tenant_id           = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```
